# Количество слов
#
# Дана строка, состоящая из слов, разделенных пробелами.
# Напишите программу, которая подсчитывает количество слов в этой строке.

in_str = input()
count = len(in_str.split())
print(count)